; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob10) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate3)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate1)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor1)
	(clear pallet6)
	(at pallet7 depot0)
	(clear crate5)
	(at pallet8 depot1)
	(clear pallet8)
	(at pallet9 distributor2)
	(clear crate0)
	(at pallet10 distributor2)
	(clear pallet10)
	(at pallet11 depot0)
	(clear pallet11)
	(at pallet12 depot1)
	(clear crate2)
	(at pallet13 depot0)
	(clear pallet13)
	(at truck0 depot1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 depot2)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 distributor0)
	(available hoist11)
	(at hoist12 distributor1)
	(available hoist12)
	(at hoist13 depot2)
	(available hoist13)
	(at hoist14 depot0)
	(available hoist14)
	(at crate0 distributor2)
	(on crate0 pallet9)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 depot1)
	(on crate2 pallet12)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 distributor0)
	(on crate4 pallet3)
	(at crate5 depot0)
	(on crate5 pallet7)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet3)
		(on crate3 pallet4)
		(on crate4 crate0)
		(on crate5 crate3)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 5
2. (lift hoist7 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist7) (on crate1 pallet2)
   added: (lifting hoist7 crate1) (clear pallet2)
   goals met: 0 of 5
3. (lift hoist3 crate4 pallet3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 pallet3)
   added: (lifting hoist3 crate4) (clear pallet3)
   goals met: 0 of 5
4. (lift hoist6 crate5 pallet7 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist6) (on crate5 pallet7)
   added: (lifting hoist6 crate5) (clear pallet7)
   goals met: 0 of 5
5. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 0 of 5
6. (load hoist7 crate1 truck1 depot2)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck1) (available hoist7)
   goals met: 0 of 5
7. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 0 of 5
8. (unload hoist11 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist11)
   added: (lifting hoist11 crate1)
   goals met: 0 of 5
9. (load hoist3 crate4 truck1 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck1) (available hoist3)
   goals met: 0 of 5
10. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 0 of 5
11. (unload hoist8 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist8)
   added: (lifting hoist8 crate4)
   goals met: 0 of 5
12. (drop hoist11 crate1 pallet3 distributor0)
   deleted: (lifting hoist11 crate1) (clear pallet3)
   added: (available hoist11) (at crate1 distributor0) (clear crate1) (on crate1 pallet3)
   goals met: 1 of 5
13. (lift hoist14 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist14) (on crate3 pallet0)
   added: (lifting hoist14 crate3) (clear pallet0)
   goals met: 1 of 5
14. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 1 of 5
15. (load hoist14 crate3 truck0 depot0)
   deleted: (lifting hoist14 crate3)
   added: (in crate3 truck0) (available hoist14)
   goals met: 1 of 5
16. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 1 of 5
17. (unload hoist9 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist9)
   added: (lifting hoist9 crate3)
   goals met: 1 of 5
18. (drop hoist9 crate3 pallet4 distributor1)
   deleted: (lifting hoist9 crate3) (clear pallet4)
   added: (available hoist9) (at crate3 distributor1) (clear crate3) (on crate3 pallet4)
   goals met: 2 of 5
19. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 2 of 5
20. (load hoist6 crate5 truck0 depot0)
   deleted: (lifting hoist6 crate5)
   added: (in crate5 truck0) (available hoist6)
   goals met: 2 of 5
21. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 2 of 5
22. (unload hoist9 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist9)
   added: (lifting hoist9 crate5)
   goals met: 2 of 5
23. (drop hoist9 crate5 crate3 distributor1)
   deleted: (lifting hoist9 crate5) (clear crate3)
   added: (available hoist9) (at crate5 distributor1) (clear crate5) (on crate5 crate3)
   goals met: 3 of 5
24. (lift hoist5 crate0 pallet9 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet9)
   added: (lifting hoist5 crate0) (clear pallet9)
   goals met: 3 of 5
25. (load hoist5 crate0 truck1 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck1) (available hoist5)
   goals met: 3 of 5
26. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 3 of 5
27. (unload hoist7 crate0 truck1 depot2)
   deleted: (in crate0 truck1) (available hoist7)
   added: (lifting hoist7 crate0)
   goals met: 3 of 5
28. (drop hoist7 crate0 pallet2 depot2)
   deleted: (lifting hoist7 crate0) (clear pallet2)
   added: (available hoist7) (at crate0 depot2) (clear crate0) (on crate0 pallet2)
   goals met: 4 of 5
29. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 4 of 5
30. (load hoist8 crate4 truck0 distributor2)
   deleted: (lifting hoist8 crate4)
   added: (in crate4 truck0) (available hoist8)
   goals met: 4 of 5
31. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 4 of 5
32. (unload hoist7 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist7)
   added: (lifting hoist7 crate4)
   goals met: 4 of 5
33. (drop hoist7 crate4 crate0 depot2)
   deleted: (lifting hoist7 crate4) (clear crate0)
   added: (available hoist7) (at crate4 depot2) (clear crate4) (on crate4 crate0)
   goals met: 5 of 5
